program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.4.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.0b2"}})]
{
    func main<ios17>(tensor<fp16, [1, 256, 64, 64]> dense_embedding, tensor<fp16, [1, 32, 256, 256]> feats_s0, tensor<fp16, [1, 64, 128, 128]> feats_s1, tensor<fp16, [1, 256, 64, 64]> image_embedding, tensor<fp16, [1, ?, 256]> sparse_embedding) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>>>((("DefaultShapes", {{"sparse_embedding", [1, 2, 256]}}), ("EnumeratedShapes", {{"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_10_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 10, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_11_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 11, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_12_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 12, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_13_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 13, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_14_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 14, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_15_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 15, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_2_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 2, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_3_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 3, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_4_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 4, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_5_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 5, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_6_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 6, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_7_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 7, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_8_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 8, 256]}}}, {"dense_embedding_1_1_256_64_64_feats_s0_1_1_32_256_256_feats_s1_1_1_64_128_128_image_embedding_1_1_256_64_64_sparse_embedding_1_1_1_9_256_", {{"dense_embedding", [1, 256, 64, 64]}, {"feats_s0", [1, 32, 256, 256]}, {"feats_s1", [1, 64, 128, 128]}, {"image_embedding", [1, 256, 64, 64]}, {"sparse_embedding", [1, 9, 256]}}}})))] {
            tensor<int32, []> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, []>(1)];
            tensor<bool, []> tokens_interleave_0 = const()[name = tensor<string, []>("tokens_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 6, 256]> var_61_to_fp16 = const()[name = tensor<string, []>("op_61_to_fp16"), val = tensor<fp16, [1, 6, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, ?, 256]> tokens_cast_fp16 = concat(axis = var_72, interleave = tokens_interleave_0, values = (var_61_to_fp16, sparse_embedding))[name = tensor<string, []>("tokens_cast_fp16")];
            tensor<fp16, [1, 256, 64, 64]> src_cast_fp16 = add(x = image_embedding, y = dense_embedding)[name = tensor<string, []>("src_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 256, 4096])];
            tensor<fp16, [1, 256, 4096]> var_100_cast_fp16 = reshape(shape = concat_0, x = src_cast_fp16)[name = tensor<string, []>("op_100_cast_fp16")];
            tensor<int32, [3]> var_104 = const()[name = tensor<string, []>("op_104"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [256, 256]> var_114_to_fp16 = const()[name = tensor<string, []>("op_114_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3200)))];
            tensor<fp16, [256]> var_115_to_fp16 = const()[name = tensor<string, []>("op_115_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134336)))];
            tensor<fp16, [1, ?, 256]> linear_0_cast_fp16 = linear(bias = var_115_to_fp16, weight = var_114_to_fp16, x = tokens_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [256, 256]> var_117_to_fp16 = const()[name = tensor<string, []>("op_117_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134912)))];
            tensor<fp16, [256]> var_118_to_fp16 = const()[name = tensor<string, []>("op_118_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(266048)))];
            tensor<fp16, [1, ?, 256]> linear_1_cast_fp16 = linear(bias = var_118_to_fp16, weight = var_117_to_fp16, x = tokens_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [256, 256]> var_120_to_fp16 = const()[name = tensor<string, []>("op_120_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(266624)))];
            tensor<fp16, [256]> var_121_to_fp16 = const()[name = tensor<string, []>("op_121_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(397760)))];
            tensor<fp16, [1, ?, 256]> linear_2_cast_fp16 = linear(bias = var_121_to_fp16, weight = var_120_to_fp16, x = tokens_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> concat_2x = const()[name = tensor<string, []>("concat_2x"), val = tensor<int32, [4]>([1, -1, 8, 32])];
            tensor<fp16, [1, ?, 8, 32]> x_3_cast_fp16 = reshape(shape = concat_2x, x = linear_0_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [4]> concat_3x = const()[name = tensor<string, []>("concat_3x"), val = tensor<int32, [4]>([1, -1, 8, 32])];
            tensor<fp16, [1, ?, 8, 32]> x_7_cast_fp16 = reshape(shape = concat_3x, x = linear_1_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, [4]> concat_4x = const()[name = tensor<string, []>("concat_4x"), val = tensor<int32, [4]>([1, -1, 8, 32])];
            tensor<fp16, [1, ?, 8, 32]> x_11_cast_fp16 = reshape(shape = concat_4x, x = linear_2_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<int32, [4]> v_1_perm_0 = const()[name = tensor<string, []>("v_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_0_y_0_to_fp16 = const()[name = tensor<string, []>("mul_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, ?, 8, 32]> mul_0_cast_fp16 = mul(x = x_3_cast_fp16, y = mul_0_y_0_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_30_perm_0 = const()[name = tensor<string, []>("transpose_30_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_31_perm_0 = const()[name = tensor<string, []>("transpose_31_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 8, ?, 32]> transpose_31 = transpose(perm = transpose_31_perm_0, x = x_7_cast_fp16)[name = tensor<string, []>("transpose_70")];
            tensor<fp16, [1, 8, ?, 32]> transpose_30 = transpose(perm = transpose_30_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_71")];
            tensor<fp16, [1, 8, ?, ?]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_30, y = transpose_31)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 8, ?, ?]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> x_13_transpose_x_0 = const()[name = tensor<string, []>("x_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_13_transpose_y_0 = const()[name = tensor<string, []>("x_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, ?, 32]> v_1_cast_fp16 = transpose(perm = v_1_perm_0, x = x_11_cast_fp16)[name = tensor<string, []>("transpose_72")];
            tensor<fp16, [1, 8, ?, 32]> x_13_cast_fp16 = matmul(transpose_x = x_13_transpose_x_0, transpose_y = x_13_transpose_y_0, x = softmax_0_cast_fp16, y = v_1_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<int32, [4]> x_15_perm_0 = const()[name = tensor<string, []>("x_15_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_5x = const()[name = tensor<string, []>("concat_5x"), val = tensor<int32, [3]>([1, -1, 256])];
            tensor<fp16, [1, ?, 8, 32]> x_15_cast_fp16 = transpose(perm = x_15_perm_0, x = x_13_cast_fp16)[name = tensor<string, []>("transpose_69")];
            tensor<fp16, [1, ?, 256]> input_1_cast_fp16 = reshape(shape = concat_5x, x = x_15_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<fp16, [256, 256]> var_209_to_fp16 = const()[name = tensor<string, []>("op_209_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(398336)))];
            tensor<fp16, [256]> var_210_to_fp16 = const()[name = tensor<string, []>("op_210_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(529472)))];
            tensor<fp16, [1, ?, 256]> linear_3_cast_fp16 = linear(bias = var_210_to_fp16, weight = var_209_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<int32, [1]> queries_1_axes_0 = const()[name = tensor<string, []>("queries_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> var_214_to_fp16 = const()[name = tensor<string, []>("op_214_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(530048)))];
            tensor<fp16, [256]> var_215_to_fp16 = const()[name = tensor<string, []>("op_215_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(530624)))];
            tensor<fp16, []> var_216_to_fp16 = const()[name = tensor<string, []>("op_216_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 256]> queries_1_cast_fp16 = layer_norm(axes = queries_1_axes_0, beta = var_215_to_fp16, epsilon = var_216_to_fp16, gamma = var_214_to_fp16, x = linear_3_cast_fp16)[name = tensor<string, []>("queries_1_cast_fp16")];
            tensor<fp16, [1, ?, 256]> input_5_cast_fp16 = add(x = queries_1_cast_fp16, y = tokens_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [1, 4096, 256]> key_pe_to_fp16 = const()[name = tensor<string, []>("key_pe_to_fp16"), val = tensor<fp16, [1, 4096, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(531200)))];
            tensor<fp16, [1, 4096, 256]> keys_1_cast_fp16 = transpose(perm = var_104, x = var_100_cast_fp16)[name = tensor<string, []>("transpose_73")];
            tensor<fp16, [1, 4096, 256]> input_7_cast_fp16 = add(x = keys_1_cast_fp16, y = key_pe_to_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [128, 256]> var_223_to_fp16 = const()[name = tensor<string, []>("op_223_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2628416)))];
            tensor<fp16, [128]> var_224_to_fp16 = const()[name = tensor<string, []>("op_224_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2694016)))];
            tensor<fp16, [1, ?, 128]> linear_4_cast_fp16 = linear(bias = var_224_to_fp16, weight = var_223_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<fp16, [128, 256]> var_226_to_fp16 = const()[name = tensor<string, []>("op_226_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2694336)))];
            tensor<fp16, [128]> var_227_to_fp16 = const()[name = tensor<string, []>("op_227_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2759936)))];
            tensor<fp16, [1, 4096, 128]> linear_5_cast_fp16 = linear(bias = var_227_to_fp16, weight = var_226_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [128, 256]> var_229_to_fp16 = const()[name = tensor<string, []>("op_229_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2760256)))];
            tensor<fp16, [128]> var_230_to_fp16 = const()[name = tensor<string, []>("op_230_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2825856)))];
            tensor<fp16, [1, 4096, 128]> linear_6_cast_fp16 = linear(bias = var_230_to_fp16, weight = var_229_to_fp16, x = keys_1_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> concat_6x = const()[name = tensor<string, []>("concat_6x"), val = tensor<int32, [4]>([1, -1, 8, 16])];
            tensor<fp16, [1, ?, 8, 16]> x_19_cast_fp16 = reshape(shape = concat_6x, x = linear_4_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<int32, [4]> var_267 = const()[name = tensor<string, []>("op_267"), val = tensor<int32, [4]>([1, 4096, 8, 16])];
            tensor<fp16, [1, 4096, 8, 16]> x_23_cast_fp16 = reshape(shape = var_267, x = linear_5_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<int32, [4]> var_287 = const()[name = tensor<string, []>("op_287"), val = tensor<int32, [4]>([1, 4096, 8, 16])];
            tensor<fp16, [1, 4096, 8, 16]> x_27_cast_fp16 = reshape(shape = var_287, x = linear_6_cast_fp16)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<int32, [4]> v_3_perm_0 = const()[name = tensor<string, []>("v_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_1_y_0_to_fp16 = const()[name = tensor<string, []>("mul_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1, ?, 8, 16]> mul_1_cast_fp16 = mul(x = x_19_cast_fp16, y = mul_1_y_0_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_32_perm_0 = const()[name = tensor<string, []>("transpose_32_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_33_perm_0 = const()[name = tensor<string, []>("transpose_33_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 8, 4096, 16]> transpose_33 = transpose(perm = transpose_33_perm_0, x = x_23_cast_fp16)[name = tensor<string, []>("transpose_66")];
            tensor<fp16, [1, 8, ?, 16]> transpose_32 = transpose(perm = transpose_32_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_67")];
            tensor<fp16, [1, 8, ?, 4096]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_32, y = transpose_33)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 8, ?, 4096]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> x_29_transpose_x_0 = const()[name = tensor<string, []>("x_29_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_29_transpose_y_0 = const()[name = tensor<string, []>("x_29_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, 4096, 16]> v_3_cast_fp16 = transpose(perm = v_3_perm_0, x = x_27_cast_fp16)[name = tensor<string, []>("transpose_68")];
            tensor<fp16, [1, 8, ?, 16]> x_29_cast_fp16 = matmul(transpose_x = x_29_transpose_x_0, transpose_y = x_29_transpose_y_0, x = softmax_1_cast_fp16, y = v_3_cast_fp16)[name = tensor<string, []>("x_29_cast_fp16")];
            tensor<int32, [4]> x_31_perm_0 = const()[name = tensor<string, []>("x_31_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_7x = const()[name = tensor<string, []>("concat_7x"), val = tensor<int32, [3]>([1, -1, 128])];
            tensor<fp16, [1, ?, 8, 16]> x_31_cast_fp16 = transpose(perm = x_31_perm_0, x = x_29_cast_fp16)[name = tensor<string, []>("transpose_65")];
            tensor<fp16, [1, ?, 128]> input_9_cast_fp16 = reshape(shape = concat_7x, x = x_31_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [256, 128]> var_318_to_fp16 = const()[name = tensor<string, []>("op_318_to_fp16"), val = tensor<fp16, [256, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2826176)))];
            tensor<fp16, [256]> var_319_to_fp16 = const()[name = tensor<string, []>("op_319_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2891776)))];
            tensor<fp16, [1, ?, 256]> linear_7_cast_fp16 = linear(bias = var_319_to_fp16, weight = var_318_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [1, ?, 256]> input_11_cast_fp16 = add(x = queries_1_cast_fp16, y = linear_7_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> var_325_to_fp16 = const()[name = tensor<string, []>("op_325_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2892352)))];
            tensor<fp16, [256]> var_326_to_fp16 = const()[name = tensor<string, []>("op_326_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2892928)))];
            tensor<fp16, []> var_327_to_fp16 = const()[name = tensor<string, []>("op_327_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 256]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = var_326_to_fp16, epsilon = var_327_to_fp16, gamma = var_325_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [2048, 256]> var_330_to_fp16 = const()[name = tensor<string, []>("op_330_to_fp16"), val = tensor<fp16, [2048, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2893504)))];
            tensor<fp16, [2048]> var_331_to_fp16 = const()[name = tensor<string, []>("op_331_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3942144)))];
            tensor<fp16, [1, ?, 2048]> linear_8_cast_fp16 = linear(bias = var_331_to_fp16, weight = var_330_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<fp16, [1, ?, 2048]> input_17_cast_fp16 = relu(x = linear_8_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [256, 2048]> var_334_to_fp16 = const()[name = tensor<string, []>("op_334_to_fp16"), val = tensor<fp16, [256, 2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3946304)))];
            tensor<fp16, [256]> var_335_to_fp16 = const()[name = tensor<string, []>("op_335_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4994944)))];
            tensor<fp16, [1, ?, 256]> linear_9_cast_fp16 = linear(bias = var_335_to_fp16, weight = var_334_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, ?, 256]> input_19_cast_fp16 = add(x = input_13_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [1]> queries_3_axes_0 = const()[name = tensor<string, []>("queries_3_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> var_341_to_fp16 = const()[name = tensor<string, []>("op_341_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4995520)))];
            tensor<fp16, [256]> var_342_to_fp16 = const()[name = tensor<string, []>("op_342_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4996096)))];
            tensor<fp16, []> var_343_to_fp16 = const()[name = tensor<string, []>("op_343_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 256]> queries_3_cast_fp16 = layer_norm(axes = queries_3_axes_0, beta = var_342_to_fp16, epsilon = var_343_to_fp16, gamma = var_341_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("queries_3_cast_fp16")];
            tensor<fp16, [1, ?, 256]> input_23_cast_fp16 = add(x = queries_3_cast_fp16, y = tokens_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [128, 256]> var_350_to_fp16 = const()[name = tensor<string, []>("op_350_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4996672)))];
            tensor<fp16, [128]> var_351_to_fp16 = const()[name = tensor<string, []>("op_351_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5062272)))];
            tensor<fp16, [1, 4096, 128]> linear_10_cast_fp16 = linear(bias = var_351_to_fp16, weight = var_350_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<fp16, [128, 256]> var_353_to_fp16 = const()[name = tensor<string, []>("op_353_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5062592)))];
            tensor<fp16, [128]> var_354_to_fp16 = const()[name = tensor<string, []>("op_354_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5128192)))];
            tensor<fp16, [1, ?, 128]> linear_11_cast_fp16 = linear(bias = var_354_to_fp16, weight = var_353_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [128, 256]> var_356_to_fp16 = const()[name = tensor<string, []>("op_356_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5128512)))];
            tensor<fp16, [128]> var_357_to_fp16 = const()[name = tensor<string, []>("op_357_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5194112)))];
            tensor<fp16, [1, ?, 128]> linear_12_cast_fp16 = linear(bias = var_357_to_fp16, weight = var_356_to_fp16, x = queries_3_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [4]> var_374 = const()[name = tensor<string, []>("op_374"), val = tensor<int32, [4]>([1, 4096, 8, 16])];
            tensor<fp16, [1, 4096, 8, 16]> x_35_cast_fp16 = reshape(shape = var_374, x = linear_10_cast_fp16)[name = tensor<string, []>("x_35_cast_fp16")];
            tensor<int32, [4]> concat_8x = const()[name = tensor<string, []>("concat_8x"), val = tensor<int32, [4]>([1, -1, 8, 16])];
            tensor<fp16, [1, ?, 8, 16]> x_39_cast_fp16 = reshape(shape = concat_8x, x = linear_11_cast_fp16)[name = tensor<string, []>("x_39_cast_fp16")];
            tensor<int32, [4]> concat_9x = const()[name = tensor<string, []>("concat_9x"), val = tensor<int32, [4]>([1, -1, 8, 16])];
            tensor<fp16, [1, ?, 8, 16]> x_43_cast_fp16 = reshape(shape = concat_9x, x = linear_12_cast_fp16)[name = tensor<string, []>("x_43_cast_fp16")];
            tensor<int32, [4]> v_5_perm_0 = const()[name = tensor<string, []>("v_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_2_y_0_to_fp16 = const()[name = tensor<string, []>("mul_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1, 4096, 8, 16]> mul_2_cast_fp16 = mul(x = x_35_cast_fp16, y = mul_2_y_0_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_34_perm_0 = const()[name = tensor<string, []>("transpose_34_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_35_perm_0 = const()[name = tensor<string, []>("transpose_35_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 8, ?, 16]> transpose_35 = transpose(perm = transpose_35_perm_0, x = x_39_cast_fp16)[name = tensor<string, []>("transpose_62")];
            tensor<fp16, [1, 8, 4096, 16]> transpose_34 = transpose(perm = transpose_34_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_63")];
            tensor<fp16, [1, 8, 4096, ?]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_34, y = transpose_35)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 8, 4096, ?]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> x_45_transpose_x_0 = const()[name = tensor<string, []>("x_45_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_45_transpose_y_0 = const()[name = tensor<string, []>("x_45_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, ?, 16]> v_5_cast_fp16 = transpose(perm = v_5_perm_0, x = x_43_cast_fp16)[name = tensor<string, []>("transpose_64")];
            tensor<fp16, [1, 8, 4096, 16]> x_45_cast_fp16 = matmul(transpose_x = x_45_transpose_x_0, transpose_y = x_45_transpose_y_0, x = softmax_2_cast_fp16, y = v_5_cast_fp16)[name = tensor<string, []>("x_45_cast_fp16")];
            tensor<int32, [4]> x_47_perm_0 = const()[name = tensor<string, []>("x_47_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_443 = const()[name = tensor<string, []>("op_443"), val = tensor<int32, [3]>([1, 4096, 128])];
            tensor<fp16, [1, 4096, 8, 16]> x_47_cast_fp16 = transpose(perm = x_47_perm_0, x = x_45_cast_fp16)[name = tensor<string, []>("transpose_61")];
            tensor<fp16, [1, 4096, 128]> input_25_cast_fp16 = reshape(shape = var_443, x = x_47_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [256, 128]> var_445_to_fp16 = const()[name = tensor<string, []>("op_445_to_fp16"), val = tensor<fp16, [256, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5194432)))];
            tensor<fp16, [256]> var_446_to_fp16 = const()[name = tensor<string, []>("op_446_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5260032)))];
            tensor<fp16, [1, 4096, 256]> linear_13_cast_fp16 = linear(bias = var_446_to_fp16, weight = var_445_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [1, 4096, 256]> input_27_cast_fp16 = add(x = keys_1_cast_fp16, y = linear_13_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<int32, [1]> keys_3_axes_0 = const()[name = tensor<string, []>("keys_3_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> var_452_to_fp16 = const()[name = tensor<string, []>("op_452_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5260608)))];
            tensor<fp16, [256]> var_453_to_fp16 = const()[name = tensor<string, []>("op_453_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5261184)))];
            tensor<fp16, []> var_454_to_fp16 = const()[name = tensor<string, []>("op_454_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 4096, 256]> keys_3_cast_fp16 = layer_norm(axes = keys_3_axes_0, beta = var_453_to_fp16, epsilon = var_454_to_fp16, gamma = var_452_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("keys_3_cast_fp16")];
            tensor<fp16, [256, 256]> var_459_to_fp16 = const()[name = tensor<string, []>("op_459_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5261760)))];
            tensor<fp16, [256]> var_460_to_fp16 = const()[name = tensor<string, []>("op_460_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5392896)))];
            tensor<fp16, [1, ?, 256]> linear_14_cast_fp16 = linear(bias = var_460_to_fp16, weight = var_459_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<fp16, [256, 256]> var_462_to_fp16 = const()[name = tensor<string, []>("op_462_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5393472)))];
            tensor<fp16, [256]> var_463_to_fp16 = const()[name = tensor<string, []>("op_463_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5524608)))];
            tensor<fp16, [1, ?, 256]> linear_15_cast_fp16 = linear(bias = var_463_to_fp16, weight = var_462_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [256, 256]> var_465_to_fp16 = const()[name = tensor<string, []>("op_465_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5525184)))];
            tensor<fp16, [256]> var_466_to_fp16 = const()[name = tensor<string, []>("op_466_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5656320)))];
            tensor<fp16, [1, ?, 256]> linear_16_cast_fp16 = linear(bias = var_466_to_fp16, weight = var_465_to_fp16, x = queries_3_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<int32, [4]> concat_10x = const()[name = tensor<string, []>("concat_10x"), val = tensor<int32, [4]>([1, -1, 8, 32])];
            tensor<fp16, [1, ?, 8, 32]> x_51_cast_fp16 = reshape(shape = concat_10x, x = linear_14_cast_fp16)[name = tensor<string, []>("x_51_cast_fp16")];
            tensor<int32, [4]> concat_11x = const()[name = tensor<string, []>("concat_11x"), val = tensor<int32, [4]>([1, -1, 8, 32])];
            tensor<fp16, [1, ?, 8, 32]> x_55_cast_fp16 = reshape(shape = concat_11x, x = linear_15_cast_fp16)[name = tensor<string, []>("x_55_cast_fp16")];
            tensor<int32, [4]> concat_12x = const()[name = tensor<string, []>("concat_12x"), val = tensor<int32, [4]>([1, -1, 8, 32])];
            tensor<fp16, [1, ?, 8, 32]> x_59_cast_fp16 = reshape(shape = concat_12x, x = linear_16_cast_fp16)[name = tensor<string, []>("x_59_cast_fp16")];
            tensor<int32, [4]> v_7_perm_0 = const()[name = tensor<string, []>("v_7_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_3_y_0_to_fp16 = const()[name = tensor<string, []>("mul_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [1, ?, 8, 32]> mul_3_cast_fp16 = mul(x = x_51_cast_fp16, y = mul_3_y_0_to_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_36_perm_0 = const()[name = tensor<string, []>("transpose_36_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_37_perm_0 = const()[name = tensor<string, []>("transpose_37_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 8, ?, 32]> transpose_37 = transpose(perm = transpose_37_perm_0, x = x_55_cast_fp16)[name = tensor<string, []>("transpose_58")];
            tensor<fp16, [1, 8, ?, 32]> transpose_36 = transpose(perm = transpose_36_perm_0, x = mul_3_cast_fp16)[name = tensor<string, []>("transpose_59")];
            tensor<fp16, [1, 8, ?, ?]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = transpose_36, y = transpose_37)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, []> softmax_3_axis_0 = const()[name = tensor<string, []>("softmax_3_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 8, ?, ?]> softmax_3_cast_fp16 = softmax(axis = softmax_3_axis_0, x = matmul_3_cast_fp16)[name = tensor<string, []>("softmax_3_cast_fp16")];
            tensor<bool, []> x_61_transpose_x_0 = const()[name = tensor<string, []>("x_61_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_61_transpose_y_0 = const()[name = tensor<string, []>("x_61_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, ?, 32]> v_7_cast_fp16 = transpose(perm = v_7_perm_0, x = x_59_cast_fp16)[name = tensor<string, []>("transpose_60")];
            tensor<fp16, [1, 8, ?, 32]> x_61_cast_fp16 = matmul(transpose_x = x_61_transpose_x_0, transpose_y = x_61_transpose_y_0, x = softmax_3_cast_fp16, y = v_7_cast_fp16)[name = tensor<string, []>("x_61_cast_fp16")];
            tensor<int32, [4]> x_63_perm_0 = const()[name = tensor<string, []>("x_63_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_13x = const()[name = tensor<string, []>("concat_13x"), val = tensor<int32, [3]>([1, -1, 256])];
            tensor<fp16, [1, ?, 8, 32]> x_63_cast_fp16 = transpose(perm = x_63_perm_0, x = x_61_cast_fp16)[name = tensor<string, []>("transpose_57")];
            tensor<fp16, [1, ?, 256]> input_31_cast_fp16 = reshape(shape = concat_13x, x = x_63_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [256, 256]> var_554_to_fp16 = const()[name = tensor<string, []>("op_554_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5656896)))];
            tensor<fp16, [256]> var_555_to_fp16 = const()[name = tensor<string, []>("op_555_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5788032)))];
            tensor<fp16, [1, ?, 256]> linear_17_cast_fp16 = linear(bias = var_555_to_fp16, weight = var_554_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, ?, 256]> input_33_cast_fp16 = add(x = queries_3_cast_fp16, y = linear_17_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [1]> queries_5_axes_0 = const()[name = tensor<string, []>("queries_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> var_561_to_fp16 = const()[name = tensor<string, []>("op_561_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5788608)))];
            tensor<fp16, [256]> var_562_to_fp16 = const()[name = tensor<string, []>("op_562_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5789184)))];
            tensor<fp16, []> var_563_to_fp16 = const()[name = tensor<string, []>("op_563_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 256]> queries_5_cast_fp16 = layer_norm(axes = queries_5_axes_0, beta = var_562_to_fp16, epsilon = var_563_to_fp16, gamma = var_561_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("queries_5_cast_fp16")];
            tensor<fp16, [1, ?, 256]> input_35_cast_fp16 = add(x = queries_5_cast_fp16, y = tokens_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [1, 4096, 256]> input_37_cast_fp16 = add(x = keys_3_cast_fp16, y = key_pe_to_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [128, 256]> var_570_to_fp16 = const()[name = tensor<string, []>("op_570_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5789760)))];
            tensor<fp16, [128]> var_571_to_fp16 = const()[name = tensor<string, []>("op_571_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5855360)))];
            tensor<fp16, [1, ?, 128]> linear_18_cast_fp16 = linear(bias = var_571_to_fp16, weight = var_570_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<fp16, [128, 256]> var_573_to_fp16 = const()[name = tensor<string, []>("op_573_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5855680)))];
            tensor<fp16, [128]> var_574_to_fp16 = const()[name = tensor<string, []>("op_574_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5921280)))];
            tensor<fp16, [1, 4096, 128]> linear_19_cast_fp16 = linear(bias = var_574_to_fp16, weight = var_573_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
            tensor<fp16, [128, 256]> var_576_to_fp16 = const()[name = tensor<string, []>("op_576_to_fp16"), val = tensor<fp16, [128, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5921600)))];
            tensor<fp16, [128]> var_577_to_fp16 = const()[name = tensor<string, []>("op_577_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5987200)))];
            tensor<fp16, [1, 4096, 128]> linear_20_cast_fp16 = linear(bias = var_577_to_fp16, weight = var_576_to_fp16, x = keys_3_cast_fp16)[name = tensor<string, []>("linear_20_cast_fp16")];
            tensor<int32, [4]> concat_14x = const()[name = tensor<string, []>("concat_14x"), val = tensor<int32, [4]>([1, -1, 8, 16])];
            tensor<fp16, [1, ?, 8, 16]> x_67_cast_fp16 = reshape(shape = concat_14x, x = linear_18_cast_fp16)[name = tensor<string, []>("x_67_cast_fp16")];
            tensor<int32, [4]> var_614 = const()[name = tensor<string, []>("op_614"), val = tensor<int32, [4]>([1, 4096, 8, 16])];
            tensor<fp16, [1, 4096, 8, 16]> x_71_cast_fp16 = reshape(shape = var_614, x = linear_19_cast_fp16)[name = tensor<string, []>("x_71_cast_fp16")];
            tensor<int32, [4]> var_634 = const()[name = tensor<string, []>("op_634"), val = tensor<int32, [4]>([1, 4096, 8, 16])];
            tensor<fp16, [1, 4096, 8, 16]> x_75_cast_fp16 = reshape(shape = var_634, x = linear_20_cast_fp16)[name = tensor<string, []>("x_75_cast_fp16")];
            tensor<int32, [4]> v_9_perm_0 = const()[name = tensor<string, []>("v_9_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_4_y_0_to_fp16 = const()[name = tensor<string, []>("mul_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-2)];
            tensor<fp16, [1, ?, 8, 16]> mul_4_cast_fp16 = mul(x = x_67_cast_fp16, y = mul_4_y_0_to_fp16)[name = tensor<string, []>("mul_4_cast_fp16")];
            tensor<bool, []> matmul_4_transpose_y_0 = const()[name = tensor<string, []>("matmul_4_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_4_transpose_x_0 = const()[name = tensor<string, []>("matmul_4_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_38_perm_0 = const()[name = tensor<string, []>("transpose_38_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_39_perm_0 = const()[name = tensor<string, []>("transpose_39_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 8, 4096, 16]> transpose_39 = transpose(perm = transpose_39_perm_0, x = x_71_cast_fp16)[name = tensor<string, []>("transpose_54")];
            tensor<fp16, [1, 8, ?, 16]> transpose_38 = transpose(perm = transpose_38_perm_0, x = mul_4_cast_fp16)[name = tensor<string, []>("transpose_55")];
            tensor<fp16, [1, 8, ?, 4096]> matmul_4_cast_fp16 = matmul(transpose_x = matmul_4_transpose_x_0, transpose_y = matmul_4_transpose_y_0, x = transpose_38, y = transpose_39)[name = tensor<string, []>("matmul_4_cast_fp16")];
            tensor<int32, []> softmax_4_axis_0 = const()[name = tensor<string, []>("softmax_4_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 8, ?, 4096]> softmax_4_cast_fp16 = softmax(axis = softmax_4_axis_0, x = matmul_4_cast_fp16)[name = tensor<string, []>("softmax_4_cast_fp16")];
            tensor<bool, []> x_77_transpose_x_0 = const()[name = tensor<string, []>("x_77_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_77_transpose_y_0 = const()[name = tensor<string, []>("x_77_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 8, 4096, 16]> v_9_cast_fp16 = transpose(perm = v_9_perm_0, x = x_75_cast_fp16)[name = tensor<string, []>("transpose_56")];
            tensor<fp16, [1, 8, ?, 16]> x_77_cast_fp16 = matmul(transpose_x = x_77_transpose_x_0, transpose_y = x_77_transpose_y_0, x = softmax_4_cast_fp16, y = v_9_cast_fp16)[name = tensor<string, []>("x_77_cast_fp16")];
            tensor<int32, [4]> x_79_perm_0 = const()[name = tensor<string, []>("x_79_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> concat_15x = const()[name = tensor<string, []>("concat_15x"), val = tensor<int32, [3]>([1, -1, 128])];
            tensor<fp16, [1, ?, 8, 16]> x_79_cast_fp16 = transpose(perm = x_79_perm_0, x = x_77_cast_fp16)[name = tensor<string, []>("transpose_53")];
            tensor<fp16, [1, ?, 128]> input_39_cast_fp16 = reshape(shape = concat_15x, x = x_79_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [256, 128]> var_665_to_fp16 = const()[name = tensor<string, []>("op_665_to_fp16"), val = tensor<fp16, [256, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5987520)))];
            tensor<fp16, [256]> var_666_to_fp16 = const()[name = tensor<string, []>("op_666_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6053120)))];
            tensor<fp16, [1, ?, 256]> linear_21_cast_fp16 = linear(bias = var_666_to_fp16, weight = var_665_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("linear_21_cast_fp16")];
            tensor<fp16, [1, ?, 256]> input_41_cast_fp16 = add(x = queries_5_cast_fp16, y = linear_21_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [1]> input_43_axes_0 = const()[name = tensor<string, []>("input_43_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> var_672_to_fp16 = const()[name = tensor<string, []>("op_672_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6053696)))];
            tensor<fp16, [256]> var_673_to_fp16 = const()[name = tensor<string, []>("op_673_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6054272)))];
            tensor<fp16, []> var_674_to_fp16 = const()[name = tensor<string, []>("op_674_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 256]> input_43_cast_fp16 = layer_norm(axes = input_43_axes_0, beta = var_673_to_fp16, epsilon = var_674_to_fp16, gamma = var_672_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<fp16, [2048, 256]> var_677_to_fp16 = const()[name = tensor<string, []>("op_677_to_fp16"), val = tensor<fp16, [2048, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6054848)))];
