{
  "_name_or_path": ".",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "S-O",
    "1": "S-O_COURIER_NAME",
    "2": "S-O_COURIER_TRACKING_NO",
    "3": "S-O_EXTRA_DIMENSION",
    "4": "S-O_EXTRA_WEIGHT",
    "5": "S-O_LABEL_SHIPMENT_TYPE",
    "6": "S-R_ADDRESS_BUILDING",
    "7": "S-R_ADDRESS_CITY",
    "8": "S-R_ADDRESS_COUNTRY",
    "9": "S-R_ADDRESS_FLOOR",
    "10": "S-R_ADDRESS_OFFICE_NO",
    "11": "S-R_ADDRESS_STATE",
    "12": "S-R_ADDRESS_STREET",
    "13": "S-R_ADDRESS_ZIP_CODE",
    "14": "S-R_PERSON_BUSINESS_NAME",
    "15": "S-R_PERSON_NAME",
    "16": "S-R_PERSON_PHONE",
    "17": "S-S_ADDRESS_BUILDING",
    "18": "S-S_ADDRESS_CITY",
    "19": "S-S_ADDRESS_COUNTRY",
    "20": "S-S_ADDRESS_FLOOR",
    "21": "S-S_ADDRESS_OFFICE_NO",
    "22": "S-S_ADDRESS_STATE",
    "23": "S-S_ADDRESS_STREET",
    "24": "S-S_ADDRESS_ZIP_CODE",
    "25": "S-S_PERSON_BUSINESS_NAME",
    "26": "S-S_PERSON_NAME",
    "27": "S-S_PERSON_PHONE",
    "28": "S-O_PURCHASE_ORDER",
    "29": "S-O_REFERENCE_NUMBER",
    "30": "S-R_ADDRESS_PO_BOX",
    "31": "S-S_ADDRESS_PO_BOX",
    "32": "S-O_RMA_NUMBER",
    "33": "S-O_INVOICE_NUMBER"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "S-O": 0,
    "S-O_COURIER_NAME": 1,
    "S-O_COURIER_TRACKING_NO": 2,
    "S-O_EXTRA_DIMENSION": 3,
    "S-O_EXTRA_WEIGHT": 4,
    "S-O_INVOICE_NUMBER": 33,
    "S-O_LABEL_SHIPMENT_TYPE": 5,
    "S-O_PURCHASE_ORDER": 28,
    "S-O_REFERENCE_NUMBER": 29,
    "S-O_RMA_NUMBER": 32,
    "S-R_ADDRESS_BUILDING": 6,
    "S-R_ADDRESS_CITY": 7,
    "S-R_ADDRESS_COUNTRY": 8,
    "S-R_ADDRESS_FLOOR": 9,
    "S-R_ADDRESS_OFFICE_NO": 10,
    "S-R_ADDRESS_PO_BOX": 30,
    "S-R_ADDRESS_STATE": 11,
    "S-R_ADDRESS_STREET": 12,
    "S-R_ADDRESS_ZIP_CODE": 13,
    "S-R_PERSON_BUSINESS_NAME": 14,
    "S-R_PERSON_NAME": 15,
    "S-R_PERSON_PHONE": 16,
    "S-S_ADDRESS_BUILDING": 17,
    "S-S_ADDRESS_CITY": 18,
    "S-S_ADDRESS_COUNTRY": 19,
    "S-S_ADDRESS_FLOOR": 20,
    "S-S_ADDRESS_OFFICE_NO": 21,
    "S-S_ADDRESS_PO_BOX": 31,
    "S-S_ADDRESS_STATE": 22,
    "S-S_ADDRESS_STREET": 23,
    "S-S_ADDRESS_ZIP_CODE": 24,
    "S-S_PERSON_BUSINESS_NAME": 25,
    "S-S_PERSON_NAME": 26,
    "S-S_PERSON_PHONE": 27
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
