program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.4.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.0b2"}})]
{
    func main<ios17>(tensor<fp32, [1, 3, 1024, 1024]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.1c4bep-6)];
            tensor<fp32, [1, 3, 1024, 1024]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> image__biased___y_0 = const()[name = tensor<string, []>("image__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1.0f177ap+1]], [[-0x1.04924ap+1]], [[-0x1.cdf012p+0]]]])];
            tensor<fp32, [1, 3, 1024, 1024]> image__biased__ = add(x = image__scaled__, y = image__biased___y_0)[name = tensor<string, []>("image__biased__")];
            tensor<int32, [2]> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<int32, [2]>([4, 4])];
            tensor<int32, [2]> var_12 = const()[name = tensor<string, []>("op_12"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_17 = const()[name = tensor<string, []>("op_17"), val = tensor<int32, []>(1)];
            tensor<string, []> x_1_pad_type_0 = const()[name = tensor<string, []>("x_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_1_pad_0 = const()[name = tensor<string, []>("x_1_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [96, 3, 7, 7]> var_2_to_fp16 = const()[name = tensor<string, []>("op_2_to_fp16"), val = tensor<fp16, [96, 3, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [96]> var_3_to_fp16 = const()[name = tensor<string, []>("op_3_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28352)))];
            tensor<fp16, [1, 3, 1024, 1024]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__biased__)[name = tensor<string, []>("cast_75")];
            tensor<fp16, [1, 96, 256, 256]> x_1_cast_fp16 = conv(bias = var_3_to_fp16, dilations = var_12, groups = var_17, pad = x_1_pad_0, pad_type = x_1_pad_type_0, strides = var_6, weight = var_2_to_fp16, x = image_to_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [4]> var_27 = const()[name = tensor<string, []>("op_27"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp32, []> pos_embed_1_scale_factor_height_0 = const()[name = tensor<string, []>("pos_embed_1_scale_factor_height_0"), val = tensor<fp32, []>(0x1.24924ap+5)];
            tensor<fp32, []> pos_embed_1_scale_factor_width_0 = const()[name = tensor<string, []>("pos_embed_1_scale_factor_width_0"), val = tensor<fp32, []>(0x1.24924ap+5)];
            tensor<bool, []> pos_embed_1_align_corners_0 = const()[name = tensor<string, []>("pos_embed_1_align_corners_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 96, 7, 7]> var_37_to_fp16 = const()[name = tensor<string, []>("op_37_to_fp16"), val = tensor<fp16, [1, 96, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(28608)))];
            tensor<fp16, [1, 96, 256, 256]> pos_embed_1_cast_fp16 = upsample_bilinear(align_corners = pos_embed_1_align_corners_0, scale_factor_height = pos_embed_1_scale_factor_height_0, scale_factor_width = pos_embed_1_scale_factor_width_0, x = var_37_to_fp16)[name = tensor<string, []>("pos_embed_1_cast_fp16")];
            tensor<fp16, [1, 96, 256, 256]> var_76_to_fp16 = const()[name = tensor<string, []>("op_76_to_fp16"), val = tensor<fp16, [1, 96, 256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38080)))];
            tensor<fp16, [1, 96, 256, 256]> pos_embed_cast_fp16 = add(x = pos_embed_1_cast_fp16, y = var_76_to_fp16)[name = tensor<string, []>("pos_embed_cast_fp16")];
            tensor<int32, [4]> var_83 = const()[name = tensor<string, []>("op_83"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 256, 256, 96]> var_84_cast_fp16 = transpose(perm = var_83, x = pos_embed_cast_fp16)[name = tensor<string, []>("transpose_172")];
            tensor<fp16, [1, 256, 256, 96]> x_3_cast_fp16 = transpose(perm = var_27, x = x_1_cast_fp16)[name = tensor<string, []>("transpose_173")];
            tensor<fp16, [1, 256, 256, 96]> input_1_cast_fp16 = add(x = x_3_cast_fp16, y = var_84_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [1]> x_5_axes_0 = const()[name = tensor<string, []>("x_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [96]> var_89_to_fp16 = const()[name = tensor<string, []>("op_89_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12621056)))];
            tensor<fp16, [96]> var_90_to_fp16 = const()[name = tensor<string, []>("op_90_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12621312)))];
            tensor<fp16, []> var_91_to_fp16 = const()[name = tensor<string, []>("op_91_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 256, 256, 96]> x_5_cast_fp16 = layer_norm(axes = x_5_axes_0, beta = var_90_to_fp16, epsilon = var_91_to_fp16, gamma = var_89_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<int32, [4]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [4]>([32, 8, 32, 768])];
            tensor<fp16, [32, 8, 32, 768]> reshape_0_cast_fp16 = reshape(shape = reshape_0_shape_0, x = x_5_cast_fp16)[name = tensor<string, []>("reshape_0_cast_fp16")];
            tensor<int32, [4]> transpose_24_perm_0 = const()[name = tensor<string, []>("transpose_24_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([-1, 8, 8, 96])];
            tensor<fp16, [32, 32, 8, 768]> transpose_24_cast_fp16 = transpose(perm = transpose_24_perm_0, x = reshape_0_cast_fp16)[name = tensor<string, []>("transpose_171")];
            tensor<fp16, [1024, 8, 8, 96]> reshape_1_cast_fp16 = reshape(shape = reshape_1_shape_0, x = transpose_24_cast_fp16)[name = tensor<string, []>("reshape_1_cast_fp16")];
            tensor<fp16, [288, 96]> var_167_to_fp16 = const()[name = tensor<string, []>("op_167_to_fp16"), val = tensor<fp16, [288, 96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12621568)))];
            tensor<fp16, [288]> var_168_to_fp16 = const()[name = tensor<string, []>("op_168_to_fp16"), val = tensor<fp16, [288]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12676928)))];
            tensor<fp16, [1024, 8, 8, 288]> linear_0_cast_fp16 = linear(bias = var_168_to_fp16, weight = var_167_to_fp16, x = reshape_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [5]> var_175 = const()[name = tensor<string, []>("op_175"), val = tensor<int32, [5]>([1024, 64, 3, 1, -1])];
            tensor<fp16, [1024, 64, 3, 1, 96]> qkv_1_cast_fp16 = reshape(shape = var_175, x = linear_0_cast_fp16)[name = tensor<string, []>("qkv_1_cast_fp16")];
            tensor<int32, [3]> var_178_split_sizes_0 = const()[name = tensor<string, []>("op_178_split_sizes_0"), val = tensor<int32, [3]>([1, 1, 1])];
            tensor<int32, []> var_178_axis_0 = const()[name = tensor<string, []>("op_178_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1024, 64, 1, 1, 96]> var_178_cast_fp16_0, tensor<fp16, [1024, 64, 1, 1, 96]> var_178_cast_fp16_1, tensor<fp16, [1024, 64, 1, 1, 96]> var_178_cast_fp16_2 = split(axis = var_178_axis_0, split_sizes = var_178_split_sizes_0, x = qkv_1_cast_fp16)[name = tensor<string, []>("op_178_cast_fp16")];
            tensor<int32, [1]> squeeze_0_axes_0 = const()[name = tensor<string, []>("squeeze_0_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 64, 1, 96]> squeeze_0_cast_fp16 = squeeze(axes = squeeze_0_axes_0, x = var_178_cast_fp16_0)[name = tensor<string, []>("squeeze_0_cast_fp16")];
            tensor<int32, [1]> squeeze_1_axes_0 = const()[name = tensor<string, []>("squeeze_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 64, 1, 96]> squeeze_1_cast_fp16 = squeeze(axes = squeeze_1_axes_0, x = var_178_cast_fp16_1)[name = tensor<string, []>("squeeze_1_cast_fp16")];
            tensor<int32, [1]> squeeze_2_axes_0 = const()[name = tensor<string, []>("squeeze_2_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 64, 1, 96]> squeeze_2_cast_fp16 = squeeze(axes = squeeze_2_axes_0, x = var_178_cast_fp16_2)[name = tensor<string, []>("squeeze_2_cast_fp16")];
            tensor<int32, [4]> var_190_perm_0 = const()[name = tensor<string, []>("op_190_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_0_y_0_to_fp16 = const()[name = tensor<string, []>("mul_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.a2p-4)];
            tensor<fp16, [1024, 64, 1, 96]> mul_0_cast_fp16 = mul(x = squeeze_0_cast_fp16, y = mul_0_y_0_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_66_perm_0 = const()[name = tensor<string, []>("transpose_66_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_67_perm_0 = const()[name = tensor<string, []>("transpose_67_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1024, 1, 64, 96]> transpose_67 = transpose(perm = transpose_67_perm_0, x = squeeze_1_cast_fp16)[name = tensor<string, []>("transpose_168")];
            tensor<fp16, [1024, 1, 64, 96]> transpose_66 = transpose(perm = transpose_66_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_169")];
            tensor<fp16, [1024, 1, 64, 64]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_66, y = transpose_67)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1024, 1, 64, 64]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> x_11_transpose_x_0 = const()[name = tensor<string, []>("x_11_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_11_transpose_y_0 = const()[name = tensor<string, []>("x_11_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1024, 1, 64, 96]> var_190_cast_fp16 = transpose(perm = var_190_perm_0, x = squeeze_2_cast_fp16)[name = tensor<string, []>("transpose_170")];
            tensor<fp16, [1024, 1, 64, 96]> x_11_cast_fp16 = matmul(transpose_x = x_11_transpose_x_0, transpose_y = x_11_transpose_y_0, x = softmax_0_cast_fp16, y = var_190_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<int32, [4]> x_13_perm_0 = const()[name = tensor<string, []>("x_13_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_200 = const()[name = tensor<string, []>("op_200"), val = tensor<int32, [4]>([1024, 8, 8, -1])];
            tensor<fp16, [1024, 64, 1, 96]> x_13_cast_fp16 = transpose(perm = x_13_perm_0, x = x_11_cast_fp16)[name = tensor<string, []>("transpose_167")];
            tensor<fp16, [1024, 8, 8, 96]> input_3_cast_fp16 = reshape(shape = var_200, x = x_13_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<fp16, [96, 96]> var_202_to_fp16 = const()[name = tensor<string, []>("op_202_to_fp16"), val = tensor<fp16, [96, 96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12677568)))];
            tensor<fp16, [96]> var_203_to_fp16 = const()[name = tensor<string, []>("op_203_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12696064)))];
            tensor<fp16, [1024, 8, 8, 96]> linear_1_cast_fp16 = linear(bias = var_203_to_fp16, weight = var_202_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> reshape_2_shape_0 = const()[name = tensor<string, []>("reshape_2_shape_0"), val = tensor<int32, [4]>([32, 32, 8, 768])];
            tensor<fp16, [32, 32, 8, 768]> reshape_2_cast_fp16 = reshape(shape = reshape_2_shape_0, x = linear_1_cast_fp16)[name = tensor<string, []>("reshape_2_cast_fp16")];
            tensor<int32, [4]> transpose_25_perm_0 = const()[name = tensor<string, []>("transpose_25_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_3_shape_0 = const()[name = tensor<string, []>("reshape_3_shape_0"), val = tensor<int32, [4]>([1, 256, 256, -1])];
            tensor<fp16, [32, 8, 32, 768]> transpose_25_cast_fp16 = transpose(perm = transpose_25_perm_0, x = reshape_2_cast_fp16)[name = tensor<string, []>("transpose_166")];
            tensor<fp16, [1, 256, 256, 96]> reshape_3_cast_fp16 = reshape(shape = reshape_3_shape_0, x = transpose_25_cast_fp16)[name = tensor<string, []>("reshape_3_cast_fp16")];
            tensor<fp16, [1, 256, 256, 96]> input_5_cast_fp16 = add(x = input_1_cast_fp16, y = reshape_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [96]> var_244_to_fp16 = const()[name = tensor<string, []>("op_244_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12696320)))];
            tensor<fp16, [96]> var_245_to_fp16 = const()[name = tensor<string, []>("op_245_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12696576)))];
            tensor<fp16, []> var_246_to_fp16 = const()[name = tensor<string, []>("op_246_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 256, 256, 96]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = var_245_to_fp16, epsilon = var_246_to_fp16, gamma = var_244_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [384, 96]> var_249_to_fp16 = const()[name = tensor<string, []>("op_249_to_fp16"), val = tensor<fp16, [384, 96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12696832)))];
            tensor<fp16, [384]> var_250_to_fp16 = const()[name = tensor<string, []>("op_250_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12770624)))];
            tensor<fp16, [1, 256, 256, 384]> linear_2_cast_fp16 = linear(bias = var_250_to_fp16, weight = var_249_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 256, 256, 384]> input_11_cast_fp16 = gelu(mode = input_11_mode_0, x = linear_2_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [96, 384]> var_254_to_fp16 = const()[name = tensor<string, []>("op_254_to_fp16"), val = tensor<fp16, [96, 384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12771456)))];
            tensor<fp16, [96]> var_255_to_fp16 = const()[name = tensor<string, []>("op_255_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12845248)))];
            tensor<fp16, [1, 256, 256, 96]> linear_3_cast_fp16 = linear(bias = var_255_to_fp16, weight = var_254_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 256, 256, 96]> x_19_cast_fp16 = add(x = input_5_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<int32, [4]> var_263 = const()[name = tensor<string, []>("op_263"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [96]> var_267_to_fp16 = const()[name = tensor<string, []>("op_267_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12845504)))];
            tensor<fp16, [96]> var_268_to_fp16 = const()[name = tensor<string, []>("op_268_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12845760)))];
            tensor<fp16, []> var_269_to_fp16 = const()[name = tensor<string, []>("op_269_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 256, 256, 96]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = var_268_to_fp16, epsilon = var_269_to_fp16, gamma = var_267_to_fp16, x = x_19_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [192, 96]> var_272_to_fp16 = const()[name = tensor<string, []>("op_272_to_fp16"), val = tensor<fp16, [192, 96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12846016)))];
            tensor<fp16, [192]> var_273_to_fp16 = const()[name = tensor<string, []>("op_273_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12882944)))];
            tensor<fp16, [1, 256, 256, 192]> linear_4_cast_fp16 = linear(bias = var_273_to_fp16, weight = var_272_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<int32, [4]> var_279 = const()[name = tensor<string, []>("op_279"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [2]> var_283 = const()[name = tensor<string, []>("op_283"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_286 = const()[name = tensor<string, []>("op_286"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> x_23_pad_type_0 = const()[name = tensor<string, []>("x_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_23_pad_0 = const()[name = tensor<string, []>("x_23_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> x_23_ceil_mode_0 = const()[name = tensor<string, []>("x_23_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 192, 256, 256]> input_15_cast_fp16 = transpose(perm = var_279, x = linear_4_cast_fp16)[name = tensor<string, []>("transpose_164")];
            tensor<fp16, [1, 192, 128, 128]> x_23_cast_fp16 = max_pool(ceil_mode = x_23_ceil_mode_0, kernel_sizes = var_283, pad = x_23_pad_0, pad_type = x_23_pad_type_0, strides = var_286, x = input_15_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<int32, [4]> var_299 = const()[name = tensor<string, []>("op_299"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [4]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [4]>([32, 8, 32, 768])];
            tensor<fp16, [32, 8, 32, 768]> reshape_4_cast_fp16 = reshape(shape = reshape_4_shape_0, x = input_13_cast_fp16)[name = tensor<string, []>("reshape_4_cast_fp16")];
            tensor<int32, [4]> transpose_26_perm_0 = const()[name = tensor<string, []>("transpose_26_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([-1, 8, 8, 96])];
            tensor<fp16, [32, 32, 8, 768]> transpose_26_cast_fp16 = transpose(perm = transpose_26_perm_0, x = reshape_4_cast_fp16)[name = tensor<string, []>("transpose_162")];
            tensor<fp16, [1024, 8, 8, 96]> reshape_5_cast_fp16 = reshape(shape = reshape_5_shape_0, x = transpose_26_cast_fp16)[name = tensor<string, []>("reshape_5_cast_fp16")];
            tensor<fp16, [576, 96]> var_374_to_fp16 = const()[name = tensor<string, []>("op_374_to_fp16"), val = tensor<fp16, [576, 96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12883392)))];
            tensor<fp16, [576]> var_375_to_fp16 = const()[name = tensor<string, []>("op_375_to_fp16"), val = tensor<fp16, [576]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12994048)))];
            tensor<fp16, [1024, 8, 8, 576]> linear_5_cast_fp16 = linear(bias = var_375_to_fp16, weight = var_374_to_fp16, x = reshape_5_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<int32, [5]> var_382 = const()[name = tensor<string, []>("op_382"), val = tensor<int32, [5]>([1024, 64, 3, 2, -1])];
            tensor<fp16, [1024, 64, 3, 2, 96]> qkv_3_cast_fp16 = reshape(shape = var_382, x = linear_5_cast_fp16)[name = tensor<string, []>("qkv_3_cast_fp16")];
            tensor<int32, [3]> var_385_split_sizes_0 = const()[name = tensor<string, []>("op_385_split_sizes_0"), val = tensor<int32, [3]>([1, 1, 1])];
            tensor<int32, []> var_385_axis_0 = const()[name = tensor<string, []>("op_385_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1024, 64, 1, 2, 96]> var_385_cast_fp16_0, tensor<fp16, [1024, 64, 1, 2, 96]> var_385_cast_fp16_1, tensor<fp16, [1024, 64, 1, 2, 96]> var_385_cast_fp16_2 = split(axis = var_385_axis_0, split_sizes = var_385_split_sizes_0, x = qkv_3_cast_fp16)[name = tensor<string, []>("op_385_cast_fp16")];
            tensor<int32, [1]> squeeze_3_axes_0 = const()[name = tensor<string, []>("squeeze_3_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 64, 2, 96]> squeeze_3_cast_fp16 = squeeze(axes = squeeze_3_axes_0, x = var_385_cast_fp16_0)[name = tensor<string, []>("squeeze_3_cast_fp16")];
            tensor<int32, [1]> squeeze_4_axes_0 = const()[name = tensor<string, []>("squeeze_4_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 64, 2, 96]> squeeze_4_cast_fp16 = squeeze(axes = squeeze_4_axes_0, x = var_385_cast_fp16_1)[name = tensor<string, []>("squeeze_4_cast_fp16")];
            tensor<int32, [1]> squeeze_5_axes_0 = const()[name = tensor<string, []>("squeeze_5_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 64, 2, 96]> squeeze_5_cast_fp16 = squeeze(axes = squeeze_5_axes_0, x = var_385_cast_fp16_2)[name = tensor<string, []>("squeeze_5_cast_fp16")];
            tensor<int32, [4]> var_390 = const()[name = tensor<string, []>("op_390"), val = tensor<int32, [4]>([1024, 8, 8, -1])];
            tensor<fp16, [1024, 8, 8, 192]> x_29_cast_fp16 = reshape(shape = var_390, x = squeeze_3_cast_fp16)[name = tensor<string, []>("x_29_cast_fp16")];
            tensor<int32, [4]> var_396 = const()[name = tensor<string, []>("op_396"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [2]> var_400 = const()[name = tensor<string, []>("op_400"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_403 = const()[name = tensor<string, []>("op_403"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> x_31_pad_type_0 = const()[name = tensor<string, []>("x_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_31_pad_0 = const()[name = tensor<string, []>("x_31_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> x_31_ceil_mode_0 = const()[name = tensor<string, []>("x_31_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1024, 192, 8, 8]> input_17_cast_fp16 = transpose(perm = var_396, x = x_29_cast_fp16)[name = tensor<string, []>("transpose_161")];
            tensor<fp16, [1024, 192, 4, 4]> x_31_cast_fp16 = max_pool(ceil_mode = x_31_ceil_mode_0, kernel_sizes = var_400, pad = x_31_pad_0, pad_type = x_31_pad_type_0, strides = var_403, x = input_17_cast_fp16)[name = tensor<string, []>("x_31_cast_fp16")];
            tensor<int32, [4]> var_416 = const()[name = tensor<string, []>("op_416"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [4]> var_430 = const()[name = tensor<string, []>("op_430"), val = tensor<int32, [4]>([1024, 16, 2, -1])];
            tensor<fp16, [1024, 4, 4, 192]> q_5_cast_fp16 = transpose(perm = var_416, x = x_31_cast_fp16)[name = tensor<string, []>("transpose_160")];
            tensor<fp16, [1024, 16, 2, 96]> q_7_cast_fp16 = reshape(shape = var_430, x = q_5_cast_fp16)[name = tensor<string, []>("q_7_cast_fp16")];
            tensor<int32, [4]> var_440_perm_0 = const()[name = tensor<string, []>("op_440_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_1_y_0_to_fp16 = const()[name = tensor<string, []>("mul_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.a2p-4)];
            tensor<fp16, [1024, 16, 2, 96]> mul_1_cast_fp16 = mul(x = q_7_cast_fp16, y = mul_1_y_0_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_68_perm_0 = const()[name = tensor<string, []>("transpose_68_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_69_perm_0 = const()[name = tensor<string, []>("transpose_69_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1024, 2, 64, 96]> transpose_69 = transpose(perm = transpose_69_perm_0, x = squeeze_4_cast_fp16)[name = tensor<string, []>("transpose_157")];
            tensor<fp16, [1024, 2, 16, 96]> transpose_68 = transpose(perm = transpose_68_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_158")];
            tensor<fp16, [1024, 2, 16, 64]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_68, y = transpose_69)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1024, 2, 16, 64]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> x_33_transpose_x_0 = const()[name = tensor<string, []>("x_33_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_33_transpose_y_0 = const()[name = tensor<string, []>("x_33_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1024, 2, 64, 96]> var_440_cast_fp16 = transpose(perm = var_440_perm_0, x = squeeze_5_cast_fp16)[name = tensor<string, []>("transpose_159")];
            tensor<fp16, [1024, 2, 16, 96]> x_33_cast_fp16 = matmul(transpose_x = x_33_transpose_x_0, transpose_y = x_33_transpose_y_0, x = softmax_1_cast_fp16, y = var_440_cast_fp16)[name = tensor<string, []>("x_33_cast_fp16")];
            tensor<int32, [4]> x_35_perm_0 = const()[name = tensor<string, []>("x_35_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_450 = const()[name = tensor<string, []>("op_450"), val = tensor<int32, [4]>([1024, 4, 4, -1])];
            tensor<fp16, [1024, 16, 2, 96]> x_35_cast_fp16 = transpose(perm = x_35_perm_0, x = x_33_cast_fp16)[name = tensor<string, []>("transpose_156")];
            tensor<fp16, [1024, 4, 4, 192]> input_19_cast_fp16 = reshape(shape = var_450, x = x_35_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<fp16, [192, 192]> var_452_to_fp16 = const()[name = tensor<string, []>("op_452_to_fp16"), val = tensor<fp16, [192, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12995264)))];
            tensor<fp16, [192]> var_453_to_fp16 = const()[name = tensor<string, []>("op_453_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13069056)))];
            tensor<fp16, [1024, 4, 4, 192]> linear_6_cast_fp16 = linear(bias = var_453_to_fp16, weight = var_452_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> reshape_6_shape_0 = const()[name = tensor<string, []>("reshape_6_shape_0"), val = tensor<int32, [4]>([32, 32, 4, 768])];
            tensor<fp16, [32, 32, 4, 768]> reshape_6_cast_fp16 = reshape(shape = reshape_6_shape_0, x = linear_6_cast_fp16)[name = tensor<string, []>("reshape_6_cast_fp16")];
            tensor<int32, [4]> transpose_27_perm_0 = const()[name = tensor<string, []>("transpose_27_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_7_shape_0 = const()[name = tensor<string, []>("reshape_7_shape_0"), val = tensor<int32, [4]>([1, 128, 128, -1])];
            tensor<fp16, [32, 4, 32, 768]> transpose_27_cast_fp16 = transpose(perm = transpose_27_perm_0, x = reshape_6_cast_fp16)[name = tensor<string, []>("transpose_155")];
            tensor<fp16, [1, 128, 128, 192]> reshape_7_cast_fp16 = reshape(shape = reshape_7_shape_0, x = transpose_27_cast_fp16)[name = tensor<string, []>("reshape_7_cast_fp16")];
            tensor<fp16, [1, 128, 128, 192]> shortcut_1_cast_fp16 = transpose(perm = var_299, x = x_23_cast_fp16)[name = tensor<string, []>("transpose_163")];
            tensor<fp16, [1, 128, 128, 192]> input_21_cast_fp16 = add(x = shortcut_1_cast_fp16, y = reshape_7_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [1]> input_23_axes_0 = const()[name = tensor<string, []>("input_23_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [192]> var_520_to_fp16 = const()[name = tensor<string, []>("op_520_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13069504)))];
            tensor<fp16, [192]> var_521_to_fp16 = const()[name = tensor<string, []>("op_521_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13069952)))];
            tensor<fp16, []> var_522_to_fp16 = const()[name = tensor<string, []>("op_522_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 128, 128, 192]> input_23_cast_fp16 = layer_norm(axes = input_23_axes_0, beta = var_521_to_fp16, epsilon = var_522_to_fp16, gamma = var_520_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [768, 192]> var_525_to_fp16 = const()[name = tensor<string, []>("op_525_to_fp16"), val = tensor<fp16, [768, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13070400)))];
            tensor<fp16, [768]> var_526_to_fp16 = const()[name = tensor<string, []>("op_526_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13365376)))];
            tensor<fp16, [1, 128, 128, 768]> linear_7_cast_fp16 = linear(bias = var_526_to_fp16, weight = var_525_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<string, []> input_27_mode_0 = const()[name = tensor<string, []>("input_27_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 128, 768]> input_27_cast_fp16 = gelu(mode = input_27_mode_0, x = linear_7_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [192, 768]> var_530_to_fp16 = const()[name = tensor<string, []>("op_530_to_fp16"), val = tensor<fp16, [192, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13366976)))];
            tensor<fp16, [192]> var_531_to_fp16 = const()[name = tensor<string, []>("op_531_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13661952)))];
            tensor<fp16, [1, 128, 128, 192]> linear_8_cast_fp16 = linear(bias = var_531_to_fp16, weight = var_530_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<fp16, [1, 128, 128, 192]> input_29_cast_fp16 = add(x = input_21_cast_fp16, y = linear_8_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [1]> x_41_axes_0 = const()[name = tensor<string, []>("x_41_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [192]> var_537_to_fp16 = const()[name = tensor<string, []>("op_537_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13662400)))];
            tensor<fp16, [192]> var_538_to_fp16 = const()[name = tensor<string, []>("op_538_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13662848)))];
            tensor<fp16, []> var_539_to_fp16 = const()[name = tensor<string, []>("op_539_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 128, 128, 192]> x_41_cast_fp16 = layer_norm(axes = x_41_axes_0, beta = var_538_to_fp16, epsilon = var_539_to_fp16, gamma = var_537_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("x_41_cast_fp16")];
            tensor<int32, [4]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [4]>([32, 4, 32, 768])];
            tensor<fp16, [32, 4, 32, 768]> reshape_8_cast_fp16 = reshape(shape = reshape_8_shape_0, x = x_41_cast_fp16)[name = tensor<string, []>("reshape_8_cast_fp16")];
            tensor<int32, [4]> transpose_28_perm_0 = const()[name = tensor<string, []>("transpose_28_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([-1, 4, 4, 192])];
            tensor<fp16, [32, 32, 4, 768]> transpose_28_cast_fp16 = transpose(perm = transpose_28_perm_0, x = reshape_8_cast_fp16)[name = tensor<string, []>("transpose_154")];
            tensor<fp16, [1024, 4, 4, 192]> reshape_9_cast_fp16 = reshape(shape = reshape_9_shape_0, x = transpose_28_cast_fp16)[name = tensor<string, []>("reshape_9_cast_fp16")];
            tensor<fp16, [576, 192]> var_615_to_fp16 = const()[name = tensor<string, []>("op_615_to_fp16"), val = tensor<fp16, [576, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13663296)))];
            tensor<fp16, [576]> var_616_to_fp16 = const()[name = tensor<string, []>("op_616_to_fp16"), val = tensor<fp16, [576]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13884544)))];
            tensor<fp16, [1024, 4, 4, 576]> linear_9_cast_fp16 = linear(bias = var_616_to_fp16, weight = var_615_to_fp16, x = reshape_9_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<int32, [5]> var_623 = const()[name = tensor<string, []>("op_623"), val = tensor<int32, [5]>([1024, 16, 3, 2, -1])];
            tensor<fp16, [1024, 16, 3, 2, 96]> qkv_5_cast_fp16 = reshape(shape = var_623, x = linear_9_cast_fp16)[name = tensor<string, []>("qkv_5_cast_fp16")];
            tensor<int32, [3]> var_626_split_sizes_0 = const()[name = tensor<string, []>("op_626_split_sizes_0"), val = tensor<int32, [3]>([1, 1, 1])];
            tensor<int32, []> var_626_axis_0 = const()[name = tensor<string, []>("op_626_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1024, 16, 1, 2, 96]> var_626_cast_fp16_0, tensor<fp16, [1024, 16, 1, 2, 96]> var_626_cast_fp16_1, tensor<fp16, [1024, 16, 1, 2, 96]> var_626_cast_fp16_2 = split(axis = var_626_axis_0, split_sizes = var_626_split_sizes_0, x = qkv_5_cast_fp16)[name = tensor<string, []>("op_626_cast_fp16")];
            tensor<int32, [1]> squeeze_6_axes_0 = const()[name = tensor<string, []>("squeeze_6_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 16, 2, 96]> squeeze_6_cast_fp16 = squeeze(axes = squeeze_6_axes_0, x = var_626_cast_fp16_0)[name = tensor<string, []>("squeeze_6_cast_fp16")];
            tensor<int32, [1]> squeeze_7_axes_0 = const()[name = tensor<string, []>("squeeze_7_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 16, 2, 96]> squeeze_7_cast_fp16 = squeeze(axes = squeeze_7_axes_0, x = var_626_cast_fp16_1)[name = tensor<string, []>("squeeze_7_cast_fp16")];
            tensor<int32, [1]> squeeze_8_axes_0 = const()[name = tensor<string, []>("squeeze_8_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1024, 16, 2, 96]> squeeze_8_cast_fp16 = squeeze(axes = squeeze_8_axes_0, x = var_626_cast_fp16_2)[name = tensor<string, []>("squeeze_8_cast_fp16")];
            tensor<int32, [4]> var_638_perm_0 = const()[name = tensor<string, []>("op_638_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> mul_2_y_0_to_fp16 = const()[name = tensor<string, []>("mul_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.a2p-4)];
            tensor<fp16, [1024, 16, 2, 96]> mul_2_cast_fp16 = mul(x = squeeze_6_cast_fp16, y = mul_2_y_0_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_70_perm_0 = const()[name = tensor<string, []>("transpose_70_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_71_perm_0 = const()[name = tensor<string, []>("transpose_71_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1024, 2, 16, 96]> transpose_71 = transpose(perm = transpose_71_perm_0, x = squeeze_7_cast_fp16)[name = tensor<string, []>("transpose_151")];
            tensor<fp16, [1024, 2, 16, 96]> transpose_70 = transpose(perm = transpose_70_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_152")];
            tensor<fp16, [1024, 2, 16, 16]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_70, y = transpose_71)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1024, 2, 16, 16]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> x_47_transpose_x_0 = const()[name = tensor<string, []>("x_47_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> x_47_transpose_y_0 = const()[name = tensor<string, []>("x_47_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1024, 2, 16, 96]> var_638_cast_fp16 = transpose(perm = var_638_perm_0, x = squeeze_8_cast_fp16)[name = tensor<string, []>("transpose_153")];
            tensor<fp16, [1024, 2, 16, 96]> x_47_cast_fp16 = matmul(transpose_x = x_47_transpose_x_0, transpose_y = x_47_transpose_y_0, x = softmax_2_cast_fp16, y = var_638_cast_fp16)[name = tensor<string, []>("x_47_cast_fp16")];
            tensor<int32, [4]> x_49_perm_0 = const()[name = tensor<string, []>("x_49_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_648 = const()[name = tensor<string, []>("op_648"), val = tensor<int32, [4]>([1024, 4, 4, -1])];
            tensor<fp16, [1024, 16, 2, 96]> x_49_cast_fp16 = transpose(perm = x_49_perm_0, x = x_47_cast_fp16)[name = tensor<string, []>("transpose_150")];
            tensor<fp16, [1024, 4, 4, 192]> input_31_cast_fp16 = reshape(shape = var_648, x = x_49_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [192, 192]> var_650_to_fp16 = const()[name = tensor<string, []>("op_650_to_fp16"), val = tensor<fp16, [192, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13885760)))];
            tensor<fp16, [192]> var_651_to_fp16 = const()[name = tensor<string, []>("op_651_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13959552)))];
            tensor<fp16, [1024, 4, 4, 192]> linear_10_cast_fp16 = linear(bias = var_651_to_fp16, weight = var_650_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<int32, [4]> reshape_10_shape_0 = const()[name = tensor<string, []>("reshape_10_shape_0"), val = tensor<int32, [4]>([32, 32, 4, 768])];
            tensor<fp16, [32, 32, 4, 768]> reshape_10_cast_fp16 = reshape(shape = reshape_10_shape_0, x = linear_10_cast_fp16)[name = tensor<string, []>("reshape_10_cast_fp16")];
            tensor<int32, [4]> transpose_29_perm_0 = const()[name = tensor<string, []>("transpose_29_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> reshape_11_shape_0 = const()[name = tensor<string, []>("reshape_11_shape_0"), val = tensor<int32, [4]>([1, 128, 128, -1])];
            tensor<fp16, [32, 4, 32, 768]> transpose_29_cast_fp16 = transpose(perm = transpose_29_perm_0, x = reshape_10_cast_fp16)[name = tensor<string, []>("transpose_149")];
            tensor<fp16, [1, 128, 128, 192]> reshape_11_cast_fp16 = reshape(shape = reshape_11_shape_0, x = transpose_29_cast_fp16)[name = tensor<string, []>("reshape_11_cast_fp16")];
            tensor<fp16, [1, 128, 128, 192]> input_33_cast_fp16 = add(x = input_29_cast_fp16, y = reshape_11_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [1]> input_35_axes_0 = const()[name = tensor<string, []>("input_35_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [192]> var_692_to_fp16 = const()[name = tensor<string, []>("op_692_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13960000)))];
            tensor<fp16, [192]> var_693_to_fp16 = const()[name = tensor<string, []>("op_693_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13960448)))];
            tensor<fp16, []> var_694_to_fp16 = const()[name = tensor<string, []>("op_694_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 128, 128, 192]> input_35_cast_fp16 = layer_norm(axes = input_35_axes_0, beta = var_693_to_fp16, epsilon = var_694_to_fp16, gamma = var_692_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [768, 192]> var_697_to_fp16 = const()[name = tensor<string, []>("op_697_to_fp16"), val = tensor<fp16, [768, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13960896)))];
            tensor<fp16, [768]> var_698_to_fp16 = const()[name = tensor<string, []>("op_698_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14255872)))];
            tensor<fp16, [1, 128, 128, 768]> linear_11_cast_fp16 = linear(bias = var_698_to_fp16, weight = var_697_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<string, []> input_39_mode_0 = const()[name = tensor<string, []>("input_39_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 128, 768]> input_39_cast_fp16 = gelu(mode = input_39_mode_0, x = linear_11_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [192, 768]> var_702_to_fp16 = const()[name = tensor<string, []>("op_702_to_fp16"), val = tensor<fp16, [192, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14257472)))];
            tensor<fp16, [192]> var_703_to_fp16 = const()[name = tensor<string, []>("op_703_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14552448)))];
            tensor<fp16, [1, 128, 128, 192]> linear_12_cast_fp16 = linear(bias = var_703_to_fp16, weight = var_702_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [1, 128, 128, 192]> x_55_cast_fp16 = add(x = input_33_cast_fp16, y = linear_12_cast_fp16)[name = tensor<string, []>("x_55_cast_fp16")];
            tensor<int32, [4]> var_711 = const()[name = tensor<string, []>("op_711"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [1]> input_41_axes_0 = const()[name = tensor<string, []>("input_41_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [192]> var_715_to_fp16 = const()[name = tensor<string, []>("op_715_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14552896)))];
            tensor<fp16, [192]> var_716_to_fp16 = const()[name = tensor<string, []>("op_716_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14553344)))];
            tensor<fp16, []> var_717_to_fp16 = const()[name = tensor<string, []>("op_717_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 128, 128, 192]> input_41_cast_fp16 = layer_norm(axes = input_41_axes_0, beta = var_716_to_fp16, epsilon = var_717_to_fp16, gamma = var_715_to_fp16, x = x_55_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [384, 192]> var_720_to_fp16 = const()[name = tensor<string, []>("op_720_to_fp16"), val = tensor<fp16, [384, 192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14553792)))];
            tensor<fp16, [384]> var_721_to_fp16 = const()[name = tensor<string, []>("op_721_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14701312)))];
            tensor<fp16, [1, 128, 128, 384]> linear_13_cast_fp16 = linear(bias = var_721_to_fp16, weight = var_720_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<int32, [4]> var_727 = const()[name = tensor<string, []>("op_727"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [2]> var_731 = const()[name = tensor<string, []>("op_731"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_734 = const()[name = tensor<string, []>("op_734"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> x_59_pad_type_0 = const()[name = tensor<string, []>("x_59_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_59_pad_0 = const()[name = tensor<string, []>("x_59_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> x_59_ceil_mode_0 = const()[name = tensor<string, []>("x_59_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 384, 128, 128]> input_43_cast_fp16 = transpose(perm = var_727, x = linear_13_cast_fp16)[name = tensor<string, []>("transpose_147")];
            tensor<fp16, [1, 384, 64, 64]> x_59_cast_fp16 = max_pool(ceil_mode = x_59_ceil_mode_0, kernel_sizes = var_731, pad = x_59_pad_0, pad_type = x_59_pad_type_0, strides = var_734, x = input_43_cast_fp16)[name = tensor<string, []>("x_59_cast_fp16")];
            tensor<int32, [4]> var_747 = const()[name = tensor<string, []>("op_747"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [4]> reshape_12_shape_0 = const()[name = tensor<string, []>("reshape_12_shape_0"), val = tensor<int32, [4]>([32, 4, 32, 768])];
            tensor<fp16, [32, 4, 32, 768]> reshape_12_cast_fp16 = reshape(shape = reshape_12_shape_0, x = input_41_cast_fp16)[name = tensor<string, []>("reshape_12_cast_fp16")];
            tensor<int32, [4]> transpose_30_perm_0 = const()[name = tensor<string, []>("transpose_30_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
